doc/ixml-to-rng.org
#+title: Translating ixml grammars into schemas
#+author: CMSMcQ 
#+date: 9 July 2024

An Invisible XML grammar /G/ describes both a set of strings and a
mapping from those strings to XML documents.  Just as not every string
is a member of the language described by the grammar /G/, so also not
every XML document is a member of the set of documents which may be
emitted by a conforming processor parsing some sentence in that
language against /G/.  It is conventional to denote the set of
sentences accepted by /G/ with the expression /L(G)/; analogously, we
can refer to the set of XML documents produced by /G/ with the
expression /X(G)/.

We can decide whether a string /s/ is a member of /L(G)/ or not by
parsing /s/ against /G/.  Can we similarly decide whether an XML
document /D/ is a member of /X(G)/?  In particular, can we construct a
schema /S/ that accepts as schema-valid all and only the documents in
/X(G)/?  If we can, how can we do so?  This would be convenient in
cases where we wish to start with some string /s/ which is an
expression in some notation /N/ for which we can construct an ixml
grammar /G/, use an ixml processor to convert /s/ into some XML
document /d/, use XML tools to modify /d/ to create some document
/d′/, and then re-serialize /d′/ as an expression /s′/ in notation
/N/.  Having a schema for the set /X(G)/ would help ensure that
document /d′/ can be successfully re-serialized in notation /N/.

If we cannot construct a schema /S/ that accepts all and only the
members of /X(G)/, then can we construct some reasonably satisfactory
approximation of /S/, which will correctly distinguish members of
/X(G)/ from non-members most of the time?

The short answer is: we cannot always construct a schema that matches
/X(G)/ perfectly, but we can come close enough to make the schema
useful, and for some grammars and some schema languages /X(G)/ can be
recognized.

This document discusses these questions and shows how to construct
schemas that approximate language /X(G)/.  It distinguishes a number
of different ways to approximate language /X(G)/ in a schema, and
describes in varying amounts of detail how to construct such schemas.

* Some preliminary definitions and assumptions

Some names are used here with conventional meanings:

- /G/ is an ixml grammar which produces well-formed XML output
  for every string generated by the grammar.

  Note that it is possible to construct /G/ in such a way that it
  accepts some strings for which its serialization markings make a
  well-formed serialization impossible.  (One simple way is to use
  nonterminals or aliases which are not legal names in XML; another is
  to require that some element have two attributes with the same
  name.)  Such grammars are excluded from consideration here.
  
- /L(G)/ is the set of input strings accepted by /G/.

- /X(G)/ is the set of XML documents produced by a conforming ixml
  processor parsing some string in /L(G)/ against /G/ .

- /S/ is, unless otherwise specified, a schema constructed to
  approximate /X(G)/.
  
- /s/ is, unless otherwise specified, an input string.

- /d/ is, unless otherwise specified, an XML document produced by
  parsing /s/ against /G/.

The schema language of primary interest is Relax NG; other schema
languages may be mentioned in passing.

* A running example

As a running example, we will use the grammar given in the "How it
works" section of the ixml specification.  It appears in two forms,
which we will call /G_0/ and /G_1/.

#+begin_src ixml
{ Grammar G_0 }
url: scheme, ":", authority, path.

scheme: letter+.

authority: "//", host.
host: sub++".".
sub: letter+.

path: ("/", seg)+.
seg: fletter*.
-letter: ["a"-"z"]; ["A"-"Z"]; ["0"-"9"].
-fletter: letter; ".".  
#+end_src

Grammar /G_1/ uses a wider variety of ixml constructs.

#+begin_src ixml
{ Grammar G_1 }
url: scheme, -":", authority, path.

@scheme: letter+.

authority: -"//", host.
host: sub++".".
-sub: letter+.

path: ("/", seg)+.
-seg: fletter*.
-letter: ["a"-"z"]; ["A"-"Z"]; ["0"-"9"].
-fletter: letter; ".".  
#+end_src

* Constraining the element and attribute structure

Let us consider first using a schema to capture constraints on
elements and attributes in /d/, in particular constraints on their
names and position, as opposed to their character-data content.

Several different kinds of consistency between /G/ and /S/ may be
distinguished.  In most cases, the resulting /S/ will accept a
superset of /X(G)/.

