doc/ixml-to-rng.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-11 Thu 14:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Translating ixml grammars into schemas</title>
<meta name="author" content="CMSMcQ" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Translating ixml grammars into schemas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbc615d0">1. Some preliminary definitions and assumptions</a></li>
<li><a href="#orga039518">2. A running example</a></li>
<li><a href="#org4e3de55">3. Constraining the element and attribute structure</a>
<ul>
<li><a href="#orgb4e9210">3.1. Name consistency (Waterloo schema)</a></li>
<li><a href="#org1f16795">3.2. Parent/child consistency</a></li>
<li><a href="#org206aedb">3.3. Content-model consistency</a></li>
</ul>
</li>
<li><a href="#orga260330">4. Constraining text nodes and attribute values</a>
<ul>
<li><a href="#org493df40">4.1. L1: directly regular constructs</a></li>
<li><a href="#org265d15e">4.2. L2: nonrecursive constructs</a></li>
<li><a href="#org0d8c49e">4.3. L3: regular approximations</a></li>
<li><a href="#org51fe562">4.4. L4: mixed-content consistency</a></li>
</ul>
</li>
<li><a href="#orga535591">5. Some complications, limitations, and gaps</a>
<ul>
<li><a href="#org9652146">5.1. Aliasing for mixed-content elements</a>
<ul>
<li><a href="#org4cc3234">5.1.1. The difficulty:  which Schematron constraint to apply?</a></li>
<li><a href="#orgb3c809c">5.1.2. When this difficulty arises</a></li>
<li><a href="#orgaa7fd7a">5.1.3. Sketch of a solution</a></li>
<li><a href="#org5f4715c">5.1.4. Some supporting theorems</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
An Invisible XML grammar <i>G</i> describes both a set of strings and a
mapping from those strings to XML documents.  Just as not every string
is a member of the language described by the grammar <i>G</i>, so also not
every XML document is a member of the set of documents which may be
emitted by a conforming processor parsing some sentence in that
language against <i>G</i>.  It is conventional to denote the set of
sentences accepted by <i>G</i> with the expression <i>L(G)</i>; analogously, we
can refer to the set of XML documents produced by <i>G</i> with the
expression <i>X(G)</i>.
</p>

<p>
We can decide whether a string <i>s</i> is a member of <i>L(G)</i> or not by
parsing <i>s</i> against <i>G</i>.  Can we similarly decide whether an XML
document <i>D</i> is a member of <i>X(G)</i>?  In particular, can we construct a
schema <i>S</i> that accepts as schema-valid all and only the documents in
<i>X(G)</i>?  If we can, how can we do so?  This would be convenient in
cases where we wish to start with some string <i>s</i> which is an
expression in some notation <i>N</i> for which we can construct an ixml
grammar <i>G</i>, use an ixml processor to convert <i>s</i> into some XML
document <i>d</i>, use XML tools to modify <i>d</i> to create some document
<i>d′</i>, and then re-serialize <i>d′</i> as an expression <i>s′</i> in notation
<i>N</i>.  Having a schema for the set <i>X(G)</i> would help ensure that
document <i>d′</i> can be successfully re-serialized in notation <i>N</i>.
</p>

<p>
If we cannot construct a schema <i>S</i> that accepts all and only the
members of <i>X(G)</i>, then can we construct some reasonably satisfactory
approximation of <i>S</i>, which will correctly distinguish members of
<i>X(G)</i> from non-members most of the time?
</p>

<p>
The short answer is: we cannot always construct a schema that matches
<i>X(G)</i> perfectly, but we can come close enough to make the schema
useful, and for some grammars and some schema languages <i>X(G)</i> can be
recognized.
</p>

<p>
This document discusses these questions and shows how to construct
schemas that approximate language <i>X(G)</i>.  It distinguishes a number
of different ways to approximate language <i>X(G)</i> in a schema, and
describes in varying amounts of detail how to construct such schemas.
</p>

<div id="outline-container-orgbc615d0" class="outline-2">
<h2 id="orgbc615d0"><span class="section-number-2">1.</span> Some preliminary definitions and assumptions</h2>
<div class="outline-text-2" id="text-1">
<p>
Some names are used here with conventional meanings:
</p>

<ul class="org-ul">
<li><p>
<i>G</i> is an ixml grammar which produces well-formed XML output
for every string generated by the grammar.
</p>

<p>
Note that it is possible to construct <i>G</i> in such a way that it
accepts some strings for which its serialization markings make a
well-formed serialization impossible.  (One simple way is to use
nonterminals or aliases which are not legal names in XML; another is
to require that some element have two attributes with the same
name.)  Such grammars are excluded from consideration here.
</p></li>

<li><i>L(G)</i> is the set of input strings accepted by <i>G</i>.</li>

<li><i>X(G)</i> is the set of XML documents produced by a conforming ixml
processor parsing some string in <i>L(G)</i> against <i>G</i> .</li>

<li><i>S</i> is, unless otherwise specified, a schema constructed to
approximate <i>X(G)</i>.</li>

<li><i>s</i> is, unless otherwise specified, an input string.</li>

<li><i>d</i> is, unless otherwise specified, an XML document produced by
parsing <i>s</i> against <i>G</i>.</li>
</ul>

<p>
The schema language of primary interest is Relax NG; other schema
languages may be mentioned in passing.
</p>
</div>
</div>

<div id="outline-container-orga039518" class="outline-2">
<h2 id="orga039518"><span class="section-number-2">2.</span> A running example</h2>
<div class="outline-text-2" id="text-2">
<p>
As a running example, we will use the grammar given in the "How it
works" section of the ixml specification.  It appears in two forms,
which we will call <i>G<sub>0</sub></i> and <i>G<sub>1</sub></i>.
</p>

<div class="org-src-container">
<pre class="src src-ixml">{ Grammar G_0 }
url: scheme, ":", authority, path.

scheme: letter+.

authority: "//", host.
host: sub++".".
sub: letter+.

path: ("/", seg)+.
seg: fletter*.
-letter: ["a"-"z"]; ["A"-"Z"]; ["0"-"9"].
-fletter: letter; ".".  
</pre>
</div>

<p>
Grammar <i>G<sub>1</sub></i> uses a wider variety of ixml constructs.
</p>

<div class="org-src-container">
<pre class="src src-ixml">{ Grammar G_1 }
url: scheme, -":", authority, path.

@scheme: letter+.

authority: -"//", host.
host: sub++".".
-sub: letter+.

path: ("/", seg)+.
-seg: fletter*.
-letter: ["a"-"z"]; ["A"-"Z"]; ["0"-"9"].
-fletter: letter; ".".  
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e3de55" class="outline-2">
<h2 id="org4e3de55"><span class="section-number-2">3.</span> Constraining the element and attribute structure</h2>
<div class="outline-text-2" id="text-3">
<p>
Let us consider first using a schema to capture constraints on
elements and attributes in <i>d</i>, in particular constraints on their
names and position, as opposed to their character-data content.
</p>

<p>
Several different kinds of consistency between <i>G</i> and <i>S</i> may be
distinguished.  In most cases, the resulting <i>S</i> will accept a
superset of <i>X(G)</i>.
</p>
</div>
