doc/ixml-to-rng.org
** Name consistency (Waterloo schema)

/S/ is name-consistent with /G/ if and only if /S/ allows all and only
the element names and attribute names found in documents in /X(G)/.

In the simple case, /S/ imposes no further constraints.

/S/ is thus analogous to the style of document type definition
sometimes called a 'Waterloo DTD', in honor of the work of the Center
for the New Oxford English Dictionary at the University of Waterloo.
They used no DTDs at all; in their SGML-like notation, any element
could appear at any place, as could character data.  That is, Waterloo
used a precursor of what is no called well-formed XML.

The 'Waterloo DTD' was as close as one could come to describing the
format using a DTD.  Because in a DTD all elements and attributes must
be declared, a Waterloo DTD (or more generally, a Waterloo schema)
declares all element types, and allows them to contain text and any
other elements.  Attributes are declared as =CDATA= and all attributes
are declared on all element types.

The SGML form of the required declarations for an element /e/ is:
#+begin_src sgml
<!ELEMENT e ANY >
<!ATTLIST e %attributes; >
#+end_src
where the parameter entity /attributes/ is assumed to contain
declarations for all attributes to be allowed.

In XML DTDs, the keyword ~ANY~ is not available, so all the elements
in the vocabulary must be enumerated in the content model.  For
grammar /G_1/, the declarations will be:
#+begin_src xml
<!ENTITY % elements "url | authority | path | host" >
<!ENTITY % attributes "scheme CDATA #IMPLIED" >
<!ELEMENT url (#PCDATA | %elements;)* >
<!ATTLIST url %attributes; >
<!ELEMENT authority (#PCDATA | %elements;)* >
<!ATTLIST authority %attributes; >
<!ELEMENT path (#PCDATA | %elements;)* >
<!ATTLIST path %attributes; >
<!ELEMENT host (#PCDATA | %elements;)* >
<!ATTLIST host %attributes; >
#+end_src

The equivalent constructs in Relax NG and XSD are straightforward,
although they are not of much interest in any case because the
validation offered by name consistency is so weak.

When /S/ is name-consistent with /G/ (and no more), then /S/
recognizes a superset of /X(G)/.

** Parent/child consistency

/S/ is parent/child-consistent with /G/ if and only if:
- /S/ is name-consistent with /G/, and
- /S/ allows any element /C/ to occur as child of some element /P/ if
  and only if elements named /C/ appears as children of elements named
  /P/ in /X(G)/, and
- /S/ allows text nodes to occur as childredn of some element /P/ if
  and only if elements named /P/ have text-node children in some
  documents of /X(G)/, and
- /S/ allows any attribute /A/ to appear on an element /E/ only if
  attributes with the name /A/ appear on elements with the name /E/
  in /X(G)/, and
- /S/ allows any element /E/ to appear as the outermost element of a
  document if and only if elements with that name appear as the
  outermost elements of documents in /X(G)/.

(Perhaps this should be called 'vertical' consistency?)

Parent/child consistency is somewhat stricter than name consistency,
although again the set of documents accepted by /S/ is a superset of
/X(G)/.  In XML DTD notation, the schema for grammar /G_1/ might read:

#+begin_src xml
<!ELEMENT url (scheme | authority | path)* >
<!ATTLIST url schema CDATA #IMPLIED >
<!ELEMENT authority (host)* >
<!ELEMENT path (#PCDATA)* >
<!ELEMENT host (#PCDATA)* >
#+end_src

