doc/ixml-to-rng.html

<div id="outline-container-orgb4e9210" class="outline-3">
<h3 id="orgb4e9210"><span class="section-number-3">3.1.</span> Name consistency (Waterloo schema)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<i>S</i> is name-consistent with <i>G</i> if and only if <i>S</i> allows all and only
the element names and attribute names found in documents in <i>X(G)</i>.
</p>

<p>
In the simple case, <i>S</i> imposes no further constraints.
</p>

<p>
<i>S</i> is thus analogous to the style of document type definition
sometimes called a 'Waterloo DTD', in honor of the work of the Center
for the New Oxford English Dictionary at the University of Waterloo.
They used no DTDs at all; in their SGML-like notation, any element
could appear at any place, as could character data.  That is, Waterloo
used a precursor of what is no called well-formed XML.
</p>

<p>
The 'Waterloo DTD' was as close as one could come to describing the
format using a DTD.  Because in a DTD all elements and attributes must
be declared, a Waterloo DTD (or more generally, a Waterloo schema)
declares all element types, and allows them to contain text and any
other elements.  Attributes are declared as <code>CDATA</code> and all attributes
are declared on all element types.
</p>

<p>
The SGML form of the required declarations for an element <i>e</i> is:
</p>
<div class="org-src-container">
<pre class="src src-sgml">&lt;!ELEMENT e ANY &gt;
&lt;!ATTLIST e %attributes; &gt;
</pre>
</div>
<p>
where the parameter entity <i>attributes</i> is assumed to contain
declarations for all attributes to be allowed.
</p>

<p>
In XML DTDs, the keyword <code>ANY</code> is not available, so all the elements
in the vocabulary must be enumerated in the content model.  For
grammar <i>G<sub>1</sub></i>, the declarations will be:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;!ENTITY % elements "url | authority | path | host" &gt;
&lt;!ENTITY % attributes "scheme CDATA #IMPLIED" &gt;
&lt;!ELEMENT url (#PCDATA | %elements;)* &gt;
&lt;!ATTLIST url %attributes; &gt;
&lt;!ELEMENT authority (#PCDATA | %elements;)* &gt;
&lt;!ATTLIST authority %attributes; &gt;
&lt;!ELEMENT path (#PCDATA | %elements;)* &gt;
&lt;!ATTLIST path %attributes; &gt;
&lt;!ELEMENT host (#PCDATA | %elements;)* &gt;
&lt;!ATTLIST host %attributes; &gt;
</pre>
</div>

<p>
The equivalent constructs in Relax NG and XSD are straightforward,
although they are not of much interest in any case because the
validation offered by name consistency is so weak.
</p>

<p>
When <i>S</i> is name-consistent with <i>G</i> (and no more), then <i>S</i>
recognizes a superset of <i>X(G)</i>.
</p>
</div>
</div>

<div id="outline-container-org1f16795" class="outline-3">
<h3 id="org1f16795"><span class="section-number-3">3.2.</span> Parent/child consistency</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<i>S</i> is parent/child-consistent with <i>G</i> if and only if:
</p>
<ul class="org-ul">
<li><i>S</i> is name-consistent with <i>G</i>, and</li>
<li><i>S</i> allows any element <i>C</i> to occur as child of some element <i>P</i> if
and only if elements named <i>C</i> appears as children of elements named
<i>P</i> in <i>X(G)</i>, and</li>
<li><i>S</i> allows text nodes to occur as childredn of some element <i>P</i> if
and only if elements named <i>P</i> have text-node children in some
documents of <i>X(G)</i>, and</li>
<li><i>S</i> allows any attribute <i>A</i> to appear on an element <i>E</i> only if
attributes with the name <i>A</i> appear on elements with the name <i>E</i>
in <i>X(G)</i>, and</li>
<li><i>S</i> allows any element <i>E</i> to appear as the outermost element of a
document if and only if elements with that name appear as the
outermost elements of documents in <i>X(G)</i>.</li>
</ul>

<p>
(Perhaps this should be called 'vertical' consistency?)
</p>

<p>
Parent/child consistency is somewhat stricter than name consistency,
although again the set of documents accepted by <i>S</i> is a superset of
<i>X(G)</i>.  In XML DTD notation, the schema for grammar <i>G<sub>1</sub></i> might read:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;!ELEMENT url (scheme | authority | path)* &gt;
&lt;!ATTLIST url schema CDATA #IMPLIED &gt;
&lt;!ELEMENT authority (host)* &gt;
&lt;!ELEMENT path (#PCDATA)* &gt;
&lt;!ELEMENT host (#PCDATA)* &gt;
</pre>
</div>
</div>
</div>
