doc/ixml-to-rng.org
** Content-model consistency

/S/ is content-model-consistent with /G/ if and only if:
- /S/ is parent/child-consistent with /G/, and
- /S/ allows, for any parent element /P/, all and only those sequences
  of child elements which occur in /X(G)/, and allows text nodes only
  in those positions of those sequences where text nodes appear in
  /X(G)/.

[Perhaps call this 'horizontal' consistency?]

For example, in Relax NG compact syntax, the schema for /G_0/ might be:
#+begin_src rnc
start = url
url =
  element url {
    scheme,
    text,
    authority,
    path
  }
scheme = element scheme { text }
authority =
  element authority {
    text,
    host
  }
path = element path { string }
host = element host { string }  
#+end_src

In these declarations, the /text/ keyword allows text in precisely
those places where the grammar requires character data: ":" as a child
of /url/ between /scheme/ and /authority/, and "~//~" as the first
child node of /authority/ before the /host/ child, and as the only
content of /host/ and /path/.  Text nodes are not allowed elsewhere.
But RNG does not allow us to require that the text nodes consist of a
full stop or a double slash, so the RNC schema just given accepts a
superset of /X(G)/.

Any schema constructed in (XML) DTD or XSD notation will accept a
larger superset, because those notations do not provide a notation for
allowing text in some but not all locations in a content model.

The schema given above for grammar /G_0/ recognizes the correct
language, but its relation to the grammar is not completely obvious:
some nonterminals appear in the schema as names of patterns and
elements or attributes, and others disappear entirely.

A simple way to arrange a mechanical translation while remaining
relatively confident that the schema correctly matches the grammar is
to translate every nonterminal /N/ in /G/ into one ore more patterns
in /S/:

- If /N/ is ever marked hidden or serialized as an element, a pattern
  named /h.N/ is generated.  Its content is a more or less literal
  transcription of /N/'s right-hand side into RNG syntax: references
  to nonterminals turn into references to appropriately named
  patterns, terminal symbols and insertions turn into the ~text~
  keyword, and repetition operators and the like turn into the
  corresponding RNG constructs, and finally the expression is
  simplified.
  
- If /N/ is ever serialized as an element, a pattern named /e.N/ is
  generated.  It generates an element declaration with an appropriate
  name and defines its content by reference to /h.N/.  If the
  nonterminal has an alias, the alias becomes the element name;
  otherwise the nonterminal itself becomes the element name.
  
- If /N/ is ever serialized as an attribute, a pattern named /a.N/ is
  generated.  It generates an attribute declaration with the
  appropriate name (alias or nonterminal) and a content declaration of
  ~text~.
  
- If /N/ is ever referred to without an explicit mark, a pattern named
  /N/ is generated, which simply refers to /h.N/, /e.N/, or /a.N/ as
  appropriate.

Following this pattern, grammar /G_1/ can be turned into an RNG schema
along the following lines.  
#+begin_src rnc
grammar {
  start = url

  url = e.url
  e.url = element url { scheme, authority, path }

  scheme = a.scheme
  a.scheme = attribute scheme {text}

  authority = e.authority
  e.authority = element authority { host }

  host = e.host
  e.host =
    element host {
      sub,
      (text, sub)*
    }

  sub = h.sub
  h.sub = letter+

  path = e.path
  e.path =
    element path {
      (text, seg)+
    }

  seg = h.seg
  h.seg = fletter*

  letter = h.letter
  h.letter = text | text | text

  fletter = h.fletter
  h.fletter = letter | text
}
#+end_src
In the schema just given, the expression for /h.letter/ has not been
simplified, in order to illustrate the kind of simplification that may
be needed.  In principle, the expression ~(text | text | text)~ should
recognize exactly the same strings as ~text~, but although in other
cases RNG takes a relaxed attitude towards non-determinism in content
models, this particular form of non-determinism is flagged as an error.

If before generating the schema we inline all hidden nonterminals in
the grammar (and simplify expressions after or during the conversion),
then the schema becomes a little tidier:
#+begin_src ixml
grammar {
  start = url

  url = e.url
  e.url = element url { scheme, authority, path }

  scheme = a.scheme
  a.scheme = attribute scheme {text}

  authority = e.authority
  e.authority = element authority { host }

  host = e.host
  e.host =
    element host {text}

  path = e.path
  e.path = element path {text}
}

#+end_src

As noted above, the ~text~ keyword is used here to constrain the
position of textual data, but no attempt is used to make it constrain
the data.  RNG and XSD (and Schematron using XPath 2.0 or higher) do
allow the schema to use regular expressions to constrain the string
values of attributes and elements with character content.  Such
constraints relate not to the element/attribute structure of the
document but to its character data and are dealt with below.


* Constraining text nodes and attribute values

For character data, we can again identify several levels of
consistency.  In all of the kinds of consistency defined below, the
schema uses regular expressions to require that some attribute values
and some textual content match the constraints expressed in the
grammar.  Different kinds of consistency vary primarily in which
attribute values and which element content the constraints are applied
to.

** L1: directly regular constructs

For any 'directly regular' element or attribute serializing some
nonterminal /N/, /S/ accepts all and only the strings in /L(N, G)/.

Here a directly regular element or attribute is the serialization of
some nonterminal /N/ whose rule in /G/ has no nonterminal symbols on
its right-hand side.  /L(N, G)/ denotes the set of strings generated
by /N/ in grammar G.

