doc/ixml-to-rng.html

<div id="outline-container-org206aedb" class="outline-3">
<h3 id="org206aedb"><span class="section-number-3">3.3.</span> Content-model consistency</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<i>S</i> is content-model-consistent with <i>G</i> if and only if:
</p>
<ul class="org-ul">
<li><i>S</i> is parent/child-consistent with <i>G</i>, and</li>
<li><i>S</i> allows, for any parent element <i>P</i>, all and only those sequences
of child elements which occur in <i>X(G)</i>, and allows text nodes only
in those positions of those sequences where text nodes appear in
<i>X(G)</i>.</li>
</ul>

<p>
[Perhaps call this 'horizontal' consistency?]
</p>

<p>
For example, in Relax NG compact syntax, the schema for <i>G<sub>0</sub></i> might be:
</p>
<div class="org-src-container">
<pre class="src src-rnc">start = url
url =
  element url {
    scheme,
    text,
    authority,
    path
  }
scheme = element scheme { text }
authority =
  element authority {
    text,
    host
  }
path = element path { string }
host = element host { string }  
</pre>
</div>

<p>
In these declarations, the <i>text</i> keyword allows text in precisely
those places where the grammar requires character data: ":" as a child
of <i>url</i> between <i>scheme</i> and <i>authority</i>, and "<code>//</code>" as the first
child node of <i>authority</i> before the <i>host</i> child, and as the only
content of <i>host</i> and <i>path</i>.  Text nodes are not allowed elsewhere.
But RNG does not allow us to require that the text nodes consist of a
full stop or a double slash, so the RNC schema just given accepts a
superset of <i>X(G)</i>.
</p>

<p>
Any schema constructed in (XML) DTD or XSD notation will accept a
larger superset, because those notations do not provide a notation for
allowing text in some but not all locations in a content model.
</p>

<p>
The schema given above for grammar <i>G<sub>0</sub></i> recognizes the correct
language, but its relation to the grammar is not completely obvious:
some nonterminals appear in the schema as names of patterns and
elements or attributes, and others disappear entirely.
</p>

<p>
A simple way to arrange a mechanical translation while remaining
relatively confident that the schema correctly matches the grammar is
to translate every nonterminal <i>N</i> in <i>G</i> into one ore more patterns
in <i>S</i>:
</p>

<ul class="org-ul">
<li>If <i>N</i> is ever marked hidden or serialized as an element, a pattern
named <i>h.N</i> is generated.  Its content is a more or less literal
transcription of <i>N</i>'s right-hand side into RNG syntax: references
to nonterminals turn into references to appropriately named
patterns, terminal symbols and insertions turn into the <code>text</code>
keyword, and repetition operators and the like turn into the
corresponding RNG constructs, and finally the expression is
simplified.</li>

<li>If <i>N</i> is ever serialized as an element, a pattern named <i>e.N</i> is
generated.  It generates an element declaration with an appropriate
name and defines its content by reference to <i>h.N</i>.  If the
nonterminal has an alias, the alias becomes the element name;
otherwise the nonterminal itself becomes the element name.</li>

<li>If <i>N</i> is ever serialized as an attribute, a pattern named <i>a.N</i> is
generated.  It generates an attribute declaration with the
appropriate name (alias or nonterminal) and a content declaration of
<code>text</code>.</li>

<li>If <i>N</i> is ever referred to without an explicit mark, a pattern named
<i>N</i> is generated, which simply refers to <i>h.N</i>, <i>e.N</i>, or <i>a.N</i> as
appropriate.</li>
</ul>

<p>
Following this pattern, grammar <i>G<sub>1</sub></i> can be turned into an RNG schema
along the following lines.  
</p>
<div class="org-src-container">
<pre class="src src-rnc">grammar {
  start = url

  url = e.url
  e.url = element url { scheme, authority, path }

  scheme = a.scheme
  a.scheme = attribute scheme {text}

  authority = e.authority
  e.authority = element authority { host }

  host = e.host
  e.host =
    element host {
      sub,
      (text, sub)*
    }

  sub = h.sub
  h.sub = letter+

  path = e.path
  e.path =
    element path {
      (text, seg)+
    }

  seg = h.seg
  h.seg = fletter*

  letter = h.letter
  h.letter = text | text | text

  fletter = h.fletter
  h.fletter = letter | text
}
</pre>
</div>
<p>
In the schema just given, the expression for <i>h.letter</i> has not been
simplified, in order to illustrate the kind of simplification that may
be needed.  In principle, the expression <code>(text | text | text)</code> should
recognize exactly the same strings as <code>text</code>, but although in other
cases RNG takes a relaxed attitude towards non-determinism in content
models, this particular form of non-determinism is flagged as an error.
</p>

<p>
If before generating the schema we inline all hidden nonterminals in
the grammar (and simplify expressions after or during the conversion),
then the schema becomes a little tidier:
</p>
<div class="org-src-container">
<pre class="src src-ixml">grammar {
  start = url

  url = e.url
  e.url = element url { scheme, authority, path }

  scheme = a.scheme
  a.scheme = attribute scheme {text}

  authority = e.authority
  e.authority = element authority { host }

  host = e.host
  e.host =
    element host {text}

  path = e.path
  e.path = element path {text}
}

</pre>
</div>

<p>
As noted above, the <code>text</code> keyword is used here to constrain the
position of textual data, but no attempt is used to make it constrain
the data.  RNG and XSD (and Schematron using XPath 2.0 or higher) do
allow the schema to use regular expressions to constrain the string
values of attributes and elements with character content.  Such
constraints relate not to the element/attribute structure of the
document but to its character data and are dealt with below.
</p>
</div>
</div>
</div>


<div id="outline-container-orga260330" class="outline-2">
<h2 id="orga260330"><span class="section-number-2">4.</span> Constraining text nodes and attribute values</h2>
<div class="outline-text-2" id="text-4">
<p>
For character data, we can again identify several levels of
consistency.  In all of the kinds of consistency defined below, the
schema uses regular expressions to require that some attribute values
and some textual content match the constraints expressed in the
grammar.  Different kinds of consistency vary primarily in which
attribute values and which element content the constraints are applied
to.
</p>
</div>

<div id="outline-container-org493df40" class="outline-3">
<h3 id="org493df40"><span class="section-number-3">4.1.</span> L1: directly regular constructs</h3>
<div class="outline-text-3" id="text-4-1">
<p>
For any 'directly regular' element or attribute serializing some
nonterminal <i>N</i>, <i>S</i> accepts all and only the strings in <i>L(N, G)</i>.
</p>

<p>
Here a directly regular element or attribute is the serialization of
some nonterminal <i>N</i> whose rule in <i>G</i> has no nonterminal symbols on
its right-hand side.  <i>L(N, G)</i> denotes the set of strings generated
by <i>N</i> in grammar G.
</p>
</div>
</div>
