doc/ixml-to-rng.org
** L2: nonrecursive constructs

For any element or attribute serializing some non-recursive
PCDATA-only nonterminal /N/, /S/ accepts all and only the strings in
/L(N, G)/.

Here a nonterminal /N/ is non-recursive if and only if /N/ is not a
possible descendant of /N/ (i.e. N is not a member of /^pc(N)/, where
/pc/ is the parent/child relation on nonterminals and /^pc/ is its
positive transitive closure), and the same holds true for all
descendants of /N/ (that is, they are also non-recursive).  A
nonterminal /N/ is PCDATA-only if (a) /N/ is serialzied as an
attribute, or (b) no member of /^pc(N)/ is serialized as an element.

[Informally: /N/ is PCDATA-only if, when /N/ is serialized as an
element, the element never has any children.]

[Note that if /N/ is non-recursive, then /L(N, G)/ is guaranteed
regular and thus expressible by a regular-expression pattern.  If the
grammar uses recursive to express iteration, /N/ may be regular
without being non-recursive.  But if all iteration is expressed in /G/
using /repeat0/ and /repeat1/, I believe /L(N, G)/ will be regular if
and only if /N/ is non-recursive.]

[Note that one might also imagine defining a level of functionality
which would involve the processor detecting recursions which could be
eliminated by rewriting the grammar using repetitions, doing so, and
constructing regular expressions from the result.  This document does
not define such a level of functionality.]

For example, at level L2, grammar /G_1/ can be approximated by the
following schema.  It is just as before, except that the values of the
/scheme/ attribute and the /sub/ and /path/ elements are constrained
as in the grammar.  The text nodes occurring between /sub/ elements
within /host/, on the other hand, are not constrained, so the schema
does not check to make sure that each such text node consists of a
single full stop.

#+begin_src ixml
grammar {
  start = url

  url = e.url
  e.url = element url { scheme, authority, path }

  scheme = a.scheme
  a.scheme =
    attribute scheme {
      xsd:string { pattern = "([a-z]|[A-Z]|[0-9])+" }
    }

  authority = e.authority
  e.authority = element authority { host }

  host = e.host
  e.host =
    element host {
      xsd:string {
        pattern = "([a-z]|[A-Z]|[0-9])+(\.([a-z]|[A-Z]|[0-9])+)*"
      }
    }

  path = e.path
  e.path =
    element path {
      xsd:string { pattern = "(/([a-z]|[A-Z]|[0-9]|\.)+)+" }
    }
}
#+end_src


** L3: regular approximations

An L3 schema /S/ satisfies these conditions:
- It satisfies the conditions of L2.
- For any element or attribute serializing some recursive PCDATA-only
  nonterminal /N/, /S/ accepts just those strings matching a regular
  approximation of /L(N, G)/.

The precise approximation chosen should be specified by the user.  As
a default, approximation U3 may be best.  U3 allows up to three
occurrences of any nonterminal N in a derivation path in the raw parse
tree.  Informally, it allows brackets up to three deep, then allows no
further brackets.

In any grammar intended for the use cases described above, the
recursive nesting in context-free languages will normally be
represented in XML by nesting elements; the ability to provide a
regular approximation of a context-free language is thus unlikely to
be very often useful in practice.  It's reassuring to know that it's
feasible in principle, but has relatively low priority.

** L4: mixed-content consistency

As for L3, and additionally /S/ includes Schematron rules for all
elements with mixed content.  The Relax NG rules allow text nodes at
appropriate locations among the children of such elements, but do not
constrain their form.  The Schematron rules define a regular
expression which matches all children, including text nodes.

Child elements are matched by writing a sole-tag with the appropriate
name into the string to match against the regular expression; to avoid
conflicts with user data containing angle brackets, the sole tag is
written using the 'tag' characters of Unicode, which are a sequence of
127 characters beginning at U+E00000, originally intended for
language-tagging in plain text and now used for locale-tagging on
emoji.  (Other mechanisms can be imagined, and some may be
preferable.)

When more than one nonterminal produces elements with the same name,
and at least one of those nonterminals produces mixed content, then
special measures are necessary to set the /context/ attribute on
Schematron rules correctly; see below.

In grammars designed for the use cases described above, mixed content
is expected to be vanishingly rare, so level-4 consistency is not
expected to be needed in practice.

# There may be a number of regularities in the XML documents produced by
# a conforming ixml processor parsing strings accepted by a given ixml
# grammar G; some schema languages can capture some of these
# regularities.  For brevity, we will say that a document or part of a
# document D is "emitted by G" if there is some input string s in L(G)
# such that D is allowed as the output of a conforming ixml processor
# parsing s against input grammar G.  


* Some complications, limitations, and gaps
This section lists some known gaps between an ideal schema for
/X(G)/ and what is practicable using RNG + Schematron.

** Aliasing for mixed-content elements
