doc/ixml-to-rng.html

<div id="outline-container-org265d15e" class="outline-3">
<h3 id="org265d15e"><span class="section-number-3">4.2.</span> L2: nonrecursive constructs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For any element or attribute serializing some non-recursive
PCDATA-only nonterminal <i>N</i>, <i>S</i> accepts all and only the strings in
<i>L(N, G)</i>.
</p>

<p>
Here a nonterminal <i>N</i> is non-recursive if and only if <i>N</i> is not a
possible descendant of <i>N</i> (i.e. N is not a member of <i>^pc(N)</i>, where
<i>pc</i> is the parent/child relation on nonterminals and <i>^pc</i> is its
positive transitive closure), and the same holds true for all
descendants of <i>N</i> (that is, they are also non-recursive).  A
nonterminal <i>N</i> is PCDATA-only if (a) <i>N</i> is serialzied as an
attribute, or (b) no member of <i>^pc(N)</i> is serialized as an element.
</p>

<p>
[Informally: <i>N</i> is PCDATA-only if, when <i>N</i> is serialized as an
element, the element never has any children.]
</p>

<p>
[Note that if <i>N</i> is non-recursive, then <i>L(N, G)</i> is guaranteed
regular and thus expressible by a regular-expression pattern.  If the
grammar uses recursive to express iteration, <i>N</i> may be regular
without being non-recursive.  But if all iteration is expressed in <i>G</i>
using <i>repeat0</i> and <i>repeat1</i>, I believe <i>L(N, G)</i> will be regular if
and only if <i>N</i> is non-recursive.]
</p>

<p>
[Note that one might also imagine defining a level of functionality
which would involve the processor detecting recursions which could be
eliminated by rewriting the grammar using repetitions, doing so, and
constructing regular expressions from the result.  This document does
not define such a level of functionality.]
</p>

<p>
For example, at level L2, grammar <i>G<sub>1</sub></i> can be approximated by the
following schema.  It is just as before, except that the values of the
<i>scheme</i> attribute and the <i>sub</i> and <i>path</i> elements are constrained
as in the grammar.  The text nodes occurring between <i>sub</i> elements
within <i>host</i>, on the other hand, are not constrained, so the schema
does not check to make sure that each such text node consists of a
single full stop.
</p>

<div class="org-src-container">
<pre class="src src-ixml">grammar {
  start = url

  url = e.url
  e.url = element url { scheme, authority, path }

  scheme = a.scheme
  a.scheme =
    attribute scheme {
      xsd:string { pattern = "([a-z]|[A-Z]|[0-9])+" }
    }

  authority = e.authority
  e.authority = element authority { host }

  host = e.host
  e.host =
    element host {
      xsd:string {
        pattern = "([a-z]|[A-Z]|[0-9])+(\.([a-z]|[A-Z]|[0-9])+)*"
      }
    }

  path = e.path
  e.path =
    element path {
      xsd:string { pattern = "(/([a-z]|[A-Z]|[0-9]|\.)+)+" }
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org0d8c49e" class="outline-3">
<h3 id="org0d8c49e"><span class="section-number-3">4.3.</span> L3: regular approximations</h3>
<div class="outline-text-3" id="text-4-3">
<p>
An L3 schema <i>S</i> satisfies these conditions:
</p>
<ul class="org-ul">
<li>It satisfies the conditions of L2.</li>
<li>For any element or attribute serializing some recursive PCDATA-only
nonterminal <i>N</i>, <i>S</i> accepts just those strings matching a regular
approximation of <i>L(N, G)</i>.</li>
</ul>

<p>
The precise approximation chosen should be specified by the user.  As
a default, approximation U3 may be best.  U3 allows up to three
occurrences of any nonterminal N in a derivation path in the raw parse
tree.  Informally, it allows brackets up to three deep, then allows no
further brackets.
</p>

<p>
In any grammar intended for the use cases described above, the
recursive nesting in context-free languages will normally be
represented in XML by nesting elements; the ability to provide a
regular approximation of a context-free language is thus unlikely to
be very often useful in practice.  It's reassuring to know that it's
feasible in principle, but has relatively low priority.
</p>
</div>
</div>

<div id="outline-container-org51fe562" class="outline-3">
<h3 id="org51fe562"><span class="section-number-3">4.4.</span> L4: mixed-content consistency</h3>
<div class="outline-text-3" id="text-4-4">
<p>
As for L3, and additionally <i>S</i> includes Schematron rules for all
elements with mixed content.  The Relax NG rules allow text nodes at
appropriate locations among the children of such elements, but do not
constrain their form.  The Schematron rules define a regular
expression which matches all children, including text nodes.
</p>

<p>
Child elements are matched by writing a sole-tag with the appropriate
name into the string to match against the regular expression; to avoid
conflicts with user data containing angle brackets, the sole tag is
written using the 'tag' characters of Unicode, which are a sequence of
127 characters beginning at U+E00000, originally intended for
language-tagging in plain text and now used for locale-tagging on
emoji.  (Other mechanisms can be imagined, and some may be
preferable.)
</p>

<p>
When more than one nonterminal produces elements with the same name,
and at least one of those nonterminals produces mixed content, then
special measures are necessary to set the <i>context</i> attribute on
Schematron rules correctly; see below.
</p>

<p>
In grammars designed for the use cases described above, mixed content
is expected to be vanishingly rare, so level-4 consistency is not
expected to be needed in practice.
</p>
</div>
</div>
</div>


<div id="outline-container-orga535591" class="outline-2">
<h2 id="orga535591"><span class="section-number-2">5.</span> Some complications, limitations, and gaps</h2>
<div class="outline-text-2" id="text-5">
<p>
This section lists some known gaps between an ideal schema for
<i>X(G)</i> and what is practicable using RNG + Schematron.
</p>
</div>

<div id="outline-container-org9652146" class="outline-3">
<h3 id="org9652146"><span class="section-number-3">5.1.</span> Aliasing for mixed-content elements</h3>
<div class="outline-text-3" id="text-5-1">
</div>
