doc/ixml-to-rng.org
*** The difficulty:  which Schematron constraint to apply?
The aliasing feature of ixml grammars allows us to give the same
element or attribute name to two different nonterminals in the
grammar.  For example, consider grammar /G3/:
#+begin_src ixml
a = b; c.
b = '[b|', b-name, '|b]'.
c = '[c|', c-name, '|c]'.
b-name > name = 'B', [L]*.
c-name > name = 'C', [L]*.
#+end_src
A /name/ element in /X(G3)/ may be the serialization of a /b-name/ or
of a /c-name/, and the pattern it must match depends on that.  But
just as ixml allows us to distinguish the nonterminal in the grammar
from the element type name in the output, RNG allows us to specify
different element declarations with the same element type name.  (XSD
allows this, too, but its requirement for deterministic content models
makes that impossible for this case.)

An RNG schema for grammar /G3/ might read:
#+begin_src rnc
namespace a = "http://relaxng.org/ns/compatibility/annotations/1.0"

start = a
a = element a { (b | c)* }
b = element b { text, b-name, text }
c = element c { text, c-name, text }
b-name =
  element name {
    xsd:string { pattern = "B\p{L}*" }
  }
c-name =
  element name {
    xsd:string { pattern = "C\p{L}*" }
  }
#+end_src
We can extend this with Schematron rules requiring that /b/ elements
begin with a text node reading "[b|" and end with a text node
reading "|b]", and that /c/ elements similarly begin and end with
"[c| " and "|c]".  The schema /S/ then matches /X(G)/ correctly.

But now consider /G4/, in which both /b/ and /c/ are serialized using
the same element name (/d/):
#+begin_src ixml
a = b+, c+.
b > d = '[b|', b-name, '|b]'.
c > d = '[c|', c-name, '|c]'.
b-name > name = 'B', [L]*.
c-name > name = 'C', [L]*.
#+end_src

The only difference in the RNG schemas for /G3/ and /G4/ is in the
definition of patterns /b/ and /c/, which now specify a different name
for the element:
#+begin_src rnc
b = element d { text, b-name, text }
c = element d { text, c-name, text }  
#+end_src
If we also show the associated Schematron rules, it will be easier to
read in the XML form:
#+begin_src rng
    <define name="b">
        <element name="d">
            <sch:rule context="d">
                <sch:assert test="'[b|&#xE003C;name&#xE002F;&#xE003E;|b]'
                    eq
                    string-join(
                    for $c in ./child::node()
                    return
                    if ($c instance of element())
                    then concat('&#xE003C;', name($c), '&#xE002F;&#xe003E;')
                    else if ($c instance of text())
                    then string($c)
                    else ''
                    )"></sch:assert>
            </sch:rule>
            <group>
                <text/>
                <ref name="b-name"/>
                <text/>
            </group>
        </element>
        
    </define>
    <define name="c">
        <element name="d">
            <sch:rule context="d">
                <sch:assert test="'[c|&#xE003C;name&#xE002F;&#xE003E;|c]'
                    eq
                    string-join(
                    for $c in ./child::node()
                    return
                    if ($c instance of element())
                    then concat('&#xE003C;', name($c), '&#xE002F;&#xe003E;')
                    else if ($c instance of text())
                    then string($c)
                    else ''
                    )"></sch:assert>
            </sch:rule>
            <group>
                <text/>
                <ref name="c-name"/>
                <text/>
            </group>
        </element>
    </define>
#+end_src
Now consider an XML document to be validated against a schema for /X(G4)/:
#+begin_src xml
<a>
    <d><name>Ba</name></d>
    <d><name>Bb</name></d>
    <d><name>Ca</name></d>
    <d><name>Cb</name></d>
</a>
#+end_src
Grammar G4 requires that all occurrences of /b-name/ precede all occurrence
of /c-name/; the RNG schema can enforce this rule, and object if the fourth
/name/ element in the document has the value "Bc".  If the second /name/ element
has the value "X", an RNG validator can say that the value must match either
the regular expression "B\p{L}*" or the expression "C\p{L}".

But we cannot use Schematron here to enforce the rule that a name
whose value starts with a "B" must be preceded by "[b|" and followed
by "|b]", and one starting with "C" must have "[c|" and "|c]".  In an
RNG schema, Schematron rules may be attached to particular patterns
and thus to particular element declarations within those patterns but
the application of the Schematron rule is governed by the XPath match
pattern given as the value of the /context/ attribute, and not by any
connection made by a schema validator between a particular pattern in
the schema and a particular element in the XML document being
validated.  (I am here following the explanation offered by Eric van
der Vlist; I have no independent knowledge of the Schematron
specification.)  The upshot is that in this case, we end up with two
Schematron rules, one applicable to some elements and the other to
other elements, with no way for the Schematron validator to know which
rule goes with which element.

*** When this difficulty arises
This problem arises when the following conditions are met:

1. More than one nonterminal in /G/ is serialized with the same
   element type name.

2. The grammar rules for these nonterminals differ.
    
3. At least one of those nonterminals produces mixed content.

Because of 3, we will want to generate a Schematron rule to check the
mixed content.  Because of 1 and 2, however, any Schematron rule we
generate will be applicable to some but not all elements with the
given element type name.  There appears to be no straightforward way
to apply each Schematron rule we generate to the appropriate elements.

