doc/ixml-to-rng.html
<div id="outline-container-org4cc3234" class="outline-4">
<h4 id="org4cc3234"><span class="section-number-4">5.1.1.</span> The difficulty:  which Schematron constraint to apply?</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
The aliasing feature of ixml grammars allows us to give the same
element or attribute name to two different nonterminals in the
grammar.  For example, consider grammar <i>G3</i>:
</p>
<div class="org-src-container">
<pre class="src src-ixml">a = b; c.
b = '[b|', b-name, '|b]'.
c = '[c|', c-name, '|c]'.
b-name &gt; name = 'B', [L]*.
c-name &gt; name = 'C', [L]*.
</pre>
</div>
<p>
A <i>name</i> element in <i>X(G3)</i> may be the serialization of a <i>b-name</i> or
of a <i>c-name</i>, and the pattern it must match depends on that.  But
just as ixml allows us to distinguish the nonterminal in the grammar
from the element type name in the output, RNG allows us to specify
different element declarations with the same element type name.  (XSD
allows this, too, but its requirement for deterministic content models
makes that impossible for this case.)
</p>

<p>
An RNG schema for grammar <i>G3</i> might read:
</p>
<div class="org-src-container">
<pre class="src src-rnc">namespace a = "http://relaxng.org/ns/compatibility/annotations/1.0"

start = a
a = element a { (b | c)* }
b = element b { text, b-name, text }
c = element c { text, c-name, text }
b-name =
  element name {
    xsd:string { pattern = "B\p{L}*" }
  }
c-name =
  element name {
    xsd:string { pattern = "C\p{L}*" }
  }
</pre>
</div>
<p>
We can extend this with Schematron rules requiring that <i>b</i> elements
begin with a text node reading "[b|" and end with a text node
reading "|b]", and that <i>c</i> elements similarly begin and end with
"[c| " and "|c]".  The schema <i>S</i> then matches <i>X(G)</i> correctly.
</p>

<p>
But now consider <i>G4</i>, in which both <i>b</i> and <i>c</i> are serialized using
the same element name (<i>d</i>):
</p>
<div class="org-src-container">
<pre class="src src-ixml">a = b+, c+.
b &gt; d = '[b|', b-name, '|b]'.
c &gt; d = '[c|', c-name, '|c]'.
b-name &gt; name = 'B', [L]*.
c-name &gt; name = 'C', [L]*.
</pre>
</div>

<p>
The only difference in the RNG schemas for <i>G3</i> and <i>G4</i> is in the
definition of patterns <i>b</i> and <i>c</i>, which now specify a different name
for the element:
</p>
<div class="org-src-container">
<pre class="src src-rnc">b = element d { text, b-name, text }
c = element d { text, c-name, text }  
</pre>
</div>
<p>
If we also show the associated Schematron rules, it will be easier to
read in the XML form:
</p>
<div class="org-src-container">
<pre class="src src-rng">&lt;define name="b"&gt;
    &lt;element name="d"&gt;
        &lt;sch:rule context="d"&gt;
            &lt;sch:assert test="'[b|&amp;#xE003C;name&amp;#xE002F;&amp;#xE003E;|b]'
                eq
                string-join(
                for $c in ./child::node()
                return
                if ($c instance of element())
                then concat('&amp;#xE003C;', name($c), '&amp;#xE002F;&amp;#xe003E;')
                else if ($c instance of text())
                then string($c)
                else ''
                )"&gt;&lt;/sch:assert&gt;
        &lt;/sch:rule&gt;
        &lt;group&gt;
            &lt;text/&gt;
            &lt;ref name="b-name"/&gt;
            &lt;text/&gt;
        &lt;/group&gt;
    &lt;/element&gt;

&lt;/define&gt;
&lt;define name="c"&gt;
    &lt;element name="d"&gt;
        &lt;sch:rule context="d"&gt;
            &lt;sch:assert test="'[c|&amp;#xE003C;name&amp;#xE002F;&amp;#xE003E;|c]'
                eq
                string-join(
                for $c in ./child::node()
                return
                if ($c instance of element())
                then concat('&amp;#xE003C;', name($c), '&amp;#xE002F;&amp;#xe003E;')
                else if ($c instance of text())
                then string($c)
                else ''
                )"&gt;&lt;/sch:assert&gt;
        &lt;/sch:rule&gt;
        &lt;group&gt;
            &lt;text/&gt;
            &lt;ref name="c-name"/&gt;
            &lt;text/&gt;
        &lt;/group&gt;
    &lt;/element&gt;
&lt;/define&gt;
</pre>
</div>
<p>
Now consider an XML document to be validated against a schema for <i>X(G4)</i>:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;a&gt;
    &lt;d&gt;&lt;name&gt;Ba&lt;/name&gt;&lt;/d&gt;
    &lt;d&gt;&lt;name&gt;Bb&lt;/name&gt;&lt;/d&gt;
    &lt;d&gt;&lt;name&gt;Ca&lt;/name&gt;&lt;/d&gt;
    &lt;d&gt;&lt;name&gt;Cb&lt;/name&gt;&lt;/d&gt;
&lt;/a&gt;
</pre>
</div>
<p>
Grammar G4 requires that all occurrences of <i>b-name</i> precede all occurrence
of <i>c-name</i>; the RNG schema can enforce this rule, and object if the fourth
<i>name</i> element in the document has the value "Bc".  If the second <i>name</i> element
has the value "X", an RNG validator can say that the value must match either
the regular expression "B\p{L}*" or the expression "C\p{L}".
</p>

<p>
But we cannot use Schematron here to enforce the rule that a name
whose value starts with a "B" must be preceded by "[b|" and followed
by "|b]", and one starting with "C" must have "[c|" and "|c]".  In an
RNG schema, Schematron rules may be attached to particular patterns
and thus to particular element declarations within those patterns but
the application of the Schematron rule is governed by the XPath match
pattern given as the value of the <i>context</i> attribute, and not by any
connection made by a schema validator between a particular pattern in
the schema and a particular element in the XML document being
validated.  (I am here following the explanation offered by Eric van
der Vlist; I have no independent knowledge of the Schematron
specification.)  The upshot is that in this case, we end up with two
Schematron rules, one applicable to some elements and the other to
other elements, with no way for the Schematron validator to know which
rule goes with which element.
</p>
</div>
</div>

<div id="outline-container-orgb3c809c" class="outline-4">
<h4 id="orgb3c809c"><span class="section-number-4">5.1.2.</span> When this difficulty arises</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
This problem arises when the following conditions are met:
</p>

<ol class="org-ol">
<li>More than one nonterminal in <i>G</i> is serialized with the same
element type name.</li>

<li>The grammar rules for these nonterminals differ.</li>

<li>At least one of those nonterminals produces mixed content.</li>
</ol>

<p>
Because of 3, we will want to generate a Schematron rule to check the
mixed content.  Because of 1 and 2, however, any Schematron rule we
generate will be applicable to some but not all elements with the
given element type name.  There appears to be no straightforward way
to apply each Schematron rule we generate to the appropriate elements.
</p>
</div>
</div>
