doc/ixml-to-rng.org
*** Sketch of a solution
In principle, this is a soluble problem.  In practice, the solution
may require more effort than it is worth, since the problem can be
avoided by eliminating mixed content in aliased elements.

Assume that some set of nonterminals /N_1/, /N_2/, ..., /N_n/ all
produce elements with the same name /e/.

- Each nonterminal /N/ generates some set of elements in /X(G)/.

- It ought in principle to be possible to construct an XPath
  expression that matches all and only those elements in /X(G)/ which
  could (based on their context) be serializations of some instance of
  /N/.

  For future reference, let us call these the base XPath expressions.

- Some elements with the name /e/ may match the XPath expression for
  exactly one /N_i/; in that case, the associated Schematron
  constraints should be applied to those elements.

- Some elements may match the XPath expression for more than one
  /N_i/; in that case, the constraint applied should be the
  disjunction of the constraints for the matching nonterminals.
  
  For example, if an element matches both /N_1/ and /N_2/, and the
  Schematron constraints for those nonterminals are /t_1/ and /t_2/,
  respectively, then the constraint to be applied to the element is
  (/t_1/ ∨ /t_2/).
  
  (This is possible because neither ixml nor RNG require grammar rules
  or content models to be deterministic or unambiguous.)

- In a given Schematron 'pattern' (or group of rules), the first rule
  with a matching /context/ fires, and no other is consulted.

  To associate Schematron rules correctly with element instances,
  therefore, it is necessary to make an XPath expression for each
  /N/_/i/ which matches only serializations of that nonterminal and no
  serializations of any other nonterminal in the set, and an XPath
  expression for each possible combination of nonterminal matched.

  For example, if three nonterminals (/N_1/, /N_2/, and /N_3/)
  are
  serialized as elements with name /e/, we will need XPath
  expressions which match
  + /N_1/ (and neither of the others)
  + /N_2/ (and neither of the others)
  + /N_3/ (and neither of the others)
  + /N_1/ or /N_2/ (but not /N_3/)
  + /N_1/ or /N_3/ (but not /N_2/)
  + /N_2/ or /N_3/ (but not /N_1/)
  + any of /N_1/, /N_2/, or /N_3/ 

  We can construct these by combining the base XPath expressions (call
  them /X_1/, /X_2/, and /X_3/) using XPath set operations:

  + /N_1/ (and neither of the others):  /X_1/ except (/X_2/ | /X_3/)
  + /N_2/ (and neither of the others):  /X_2/ except (/X_1/ | /X_3/)
  + /N_3/ (and neither of the others):  /X_3/ except (/X_1/ | /X_2/)
  + /N_1/ or /N_2/ (but not /N_3/):  (/X_1/ | /X_2/) except /X_3/ 
  + /N_1/ or /N_3/ (but not /N_2/):  (/X_1/ | /X_3/) except /X_2/ 
  + /N_2/ or /N_3/ (but not /N_1/):  (/X_2/ | /X_3/) except /X_1/ 
  + /N_1/ or /N_2/ or /N_3/:  /X_1/ | /X_2/ | /X_3/

