doc/ixml-to-rng.html

<div id="outline-container-orgaa7fd7a" class="outline-4">
<h4 id="orgaa7fd7a"><span class="section-number-4">5.1.3.</span> Sketch of a solution</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
In principle, this is a soluble problem.  In practice, the solution
may require more effort than it is worth, since the problem can be
avoided by eliminating mixed content in aliased elements.
</p>

<p>
Assume that some set of nonterminals <i>N<sub>1</sub></i>, <i>N<sub>2</sub></i>, &#x2026;, <i>N<sub>n</sub></i> all
produce elements with the same name <i>e</i>.
</p>

<ul class="org-ul">
<li>Each nonterminal <i>N</i> generates some set of elements in <i>X(G)</i>.</li>

<li><p>
It ought in principle to be possible to construct an XPath
expression that matches all and only those elements in <i>X(G)</i> which
could (based on their context) be serializations of some instance of
<i>N</i>.
</p>

<p>
For future reference, let us call these the base XPath expressions.
</p></li>

<li>Some elements with the name <i>e</i> may match the XPath expression for
exactly one <i>N<sub>i</sub></i>; in that case, the associated Schematron
constraints should be applied to those elements.</li>

<li><p>
Some elements may match the XPath expression for more than one
<i>N<sub>i</sub></i>; in that case, the constraint applied should be the
disjunction of the constraints for the matching nonterminals.
</p>

<p>
For example, if an element matches both <i>N<sub>1</sub></i> and <i>N<sub>2</sub></i>, and the
Schematron constraints for those nonterminals are <i>t<sub>1</sub></i> and <i>t<sub>2</sub></i>,
respectively, then the constraint to be applied to the element is
(<i>t<sub>1</sub></i> ∨ <i>t<sub>2</sub></i>).
</p>

<p>
(This is possible because neither ixml nor RNG require grammar rules
or content models to be deterministic or unambiguous.)
</p></li>

<li><p>
In a given Schematron 'pattern' (or group of rules), the first rule
with a matching <i>context</i> fires, and no other is consulted.
</p>

<p>
To associate Schematron rules correctly with element instances,
therefore, it is necessary to make an XPath expression for each
<i>N/_/i</i> which matches only serializations of that nonterminal and no
serializations of any other nonterminal in the set, and an XPath
expression for each possible combination of nonterminal matched.
</p>

<p>
For example, if three nonterminals (<i>N<sub>1</sub></i>, <i>N<sub>2</sub></i>, and <i>N<sub>3</sub></i>)
are
serialized as elements with name <i>e</i>, we will need XPath
expressions which match
</p>
<ul class="org-ul">
<li><i>N<sub>1</sub></i> (and neither of the others)</li>
<li><i>N<sub>2</sub></i> (and neither of the others)</li>
<li><i>N<sub>3</sub></i> (and neither of the others)</li>
<li><i>N<sub>1</sub></i> or <i>N<sub>2</sub></i> (but not <i>N<sub>3</sub></i>)</li>
<li><i>N<sub>1</sub></i> or <i>N<sub>3</sub></i> (but not <i>N<sub>2</sub></i>)</li>
<li><i>N<sub>2</sub></i> or <i>N<sub>3</sub></i> (but not <i>N<sub>1</sub></i>)</li>
<li>any of <i>N<sub>1</sub></i>, <i>N<sub>2</sub></i>, or <i>N<sub>3</sub></i></li>
</ul>

<p>
We can construct these by combining the base XPath expressions (call
them <i>X<sub>1</sub></i>, <i>X<sub>2</sub></i>, and <i>X<sub>3</sub></i>) using XPath set operations:
</p>

<ul class="org-ul">
<li><i>N<sub>1</sub></i> (and neither of the others):  <i>X<sub>1</sub></i> except (<i>X<sub>2</sub></i> | <i>X<sub>3</sub></i>)</li>
<li><i>N<sub>2</sub></i> (and neither of the others):  <i>X<sub>2</sub></i> except (<i>X<sub>1</sub></i> | <i>X<sub>3</sub></i>)</li>
<li><i>N<sub>3</sub></i> (and neither of the others):  <i>X<sub>3</sub></i> except (<i>X<sub>1</sub></i> | <i>X<sub>2</sub></i>)</li>
<li><i>N<sub>1</sub></i> or <i>N<sub>2</sub></i> (but not <i>N<sub>3</sub></i>):  (<i>X<sub>1</sub></i> | <i>X<sub>2</sub></i>) except <i>X<sub>3</sub></i></li>
<li><i>N<sub>1</sub></i> or <i>N<sub>3</sub></i> (but not <i>N<sub>2</sub></i>):  (<i>X<sub>1</sub></i> | <i>X<sub>3</sub></i>) except <i>X<sub>2</sub></i></li>
<li><i>N<sub>2</sub></i> or <i>N<sub>3</sub></i> (but not <i>N<sub>1</sub></i>):  (<i>X<sub>2</sub></i> | <i>X<sub>3</sub></i>) except <i>X<sub>1</sub></i></li>
<li><i>N<sub>1</sub></i> or <i>N<sub>2</sub></i> or <i>N<sub>3</sub></i>:  <i>X<sub>1</sub></i> | <i>X<sub>2</sub></i> | <i>X<sub>3</sub></i></li>
</ul></li>
</ul>
</div>
</div>
