doc/ixml-to-rng.org
*** Some supporting theorems
Is it in fact possible to construct the base XPath expressions needed
in the solution sketched above?  I think the answer is yes.

/Theorem:/ For any nonterminal /N/ in /G/ the set of ancestor paths of
/N/ (i.e. paths from the root of the raw parse tree [not the
serialized XML] to an instance of /N/) is a regular language.

/Proof:/ We can construct a finite state automaton /A/ = (/Q/, Σ, δ,
/q/_0, /F/), with
- /Q/ = the set of nonterminals in /G/
- Σ = the set of nonterminals in /G/
- δ = the set of triples (/P/, /C/, /C/) where nonterminal /C/
  appears in the right-hand side of nonterminal /P/.
- /q/_0
  is the start symbol of
  /G/
- /F/ = {/N/}

It is evident that the set of strings accepted by this FSA is the set
of paths in raw parse trees beginning at the start symbol and ending
at /N/.

/Corollary:/ For any nonterminal /N/ in /G/ serialized as an element
named /e/ or an attribute named /a/, it is possible to construct an
XPath expression which matches only those /e/ elements or /a/
attributes whose ancestry matches that of elements or attributes in
/X(G)/ serialized from occurrences of /N/.

/Proof:/ In the FSA described above, split the state for each
nonterminal /N/ into three states, one each for /N/ serialized as
element, serialized as attribute, and hidden.  Ajust the transitions
accordingly.  The final state has now been split into three states;
drop the hidden-nonterminal state from the set /F/.  Then change every
transition to a hidden nonterminal to an empty transition, and delete
every transition out of any nonterminal serialized as an attribute.
For every nonterminal /N/ serialized using an alias /A/, change the
symbol in all incoming arcs to state /N/ to read /A/ instead of /N/.

From this modified FSA, we can construct a regular expression matching
all and only the paths leading to serializations of /N/ as an element,
and a second one matching all and only the paths leading to
serializations of /N/ as an attribute, and we can construct an XPath
expression which constructs a string describing the ancestry of any
element or attribute.  The XPath expression will match all
serializations of /N/ as attributes or elements, and also other
elements named /e/ and attributes named /a/ which share the same
ancestry but are serializations of some other nontterminal (if there
are any such).

For example, the serializations of nonterminal /b/ in grammar /G4/
can be matched by the expression
#+begin_src xpath
//e['/' || stringjoin(ancestor-or-self::*/name(), '/')
    eq
    '/a/d']
#+end_src

/[Better example would be helpful, but the grammars given above are
all too simple.]/

/Theorem:/ For any occurrence of nonterminal /N/ in a right-hand side
of /G/, where /N/ is serialized as an element /e/, it is possible to
construct an XPath expression matching all and only elements /e/ whose
preceding element siblings match the preceding siblings of some
element /e/ in /X(G)/ serialized from an instance of /N/ with the same
ancestry.

/Proof:/ Without loss of generality, assume that there are no hidden
nonterminals in the right-hand side containing /N/.  (See below for
cases where this is not given a priori.)  If all terminal symbols and
all nonterminals to be serialized as attributes are deleted from the
expression, what remains is a regular expressoin over non-hidden
nonterminals.  This regular expression can be transformed into a
finite state automaton using standard methods.  If in that FSA the set
of final states is changed to include only the occurrences of /N/, the
FSA will accept all and only the left-to-right paths through the
content model which terminate in /N/.  A regular expression can be
constructed from that FSA, and from that regular expression an XPath
expression, along the lines shown above for the ancestry expression.

(It may be possible to construct the regular expression more directly,
but I don't currently see a clean way to do so.)

If the assumption does not hold, it can be made to hold by inlining
the definitions of the hidden nonterminals until either (a) there are
no more hidden nonterminals, or (b) the only remaining hidden
nonterminals are recursive but lack any descedants serialized as
elements.  In case (a), the assumption now holds.  In case (b) the
remaining hidden nonterminals can simply be deleted.  Since they
generate only character data, and character data is ignored in the
construction of the XPath expression, they cannot affect the XPath
expression.

/Corollary:/ For any nonterminal /N/ serialized as an element, it is
possible to construct an XPath expression which matches all elements
serialized from /N/ and no elements which do not have the same upper
and left context as some of those elements.

/Proof:/ Follows immediately.  The two XPath expressions described
above can be combined to select only elements whose ancestry and left
context are both suitable.

