doc/ixml-to-rng.html

<div id="outline-container-org5f4715c" class="outline-4">
<h4 id="org5f4715c"><span class="section-number-4">5.1.4.</span> Some supporting theorems</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
Is it in fact possible to construct the base XPath expressions needed
in the solution sketched above?  I think the answer is yes.
</p>

<p>
<i>Theorem:</i> For any nonterminal <i>N</i> in <i>G</i> the set of ancestor paths of
<i>N</i> (i.e. paths from the root of the raw parse tree [not the
serialized XML] to an instance of <i>N</i>) is a regular language.
</p>

<p>
<i>Proof:</i> We can construct a finite state automaton <i>A</i> = (<i>Q</i>, Σ, δ,
<i>q/<sub>0</sub>, /F</i>), with
</p>
<ul class="org-ul">
<li><i>Q</i> = the set of nonterminals in <i>G</i></li>
<li>Σ = the set of nonterminals in <i>G</i></li>
<li>δ = the set of triples (<i>P</i>, <i>C</i>, <i>C</i>) where nonterminal <i>C</i>
appears in the right-hand side of nonterminal <i>P</i>.</li>
<li>/q/<sub>0</sub>
is the start symbol of
<i>G</i></li>
<li><i>F</i> = {<i>N</i>}</li>
</ul>

<p>
It is evident that the set of strings accepted by this FSA is the set
of paths in raw parse trees beginning at the start symbol and ending
at <i>N</i>.
</p>

<p>
<i>Corollary:</i> For any nonterminal <i>N</i> in <i>G</i> serialized as an element
named <i>e</i> or an attribute named <i>a</i>, it is possible to construct an
XPath expression which matches only those <i>e</i> elements or <i>a</i>
attributes whose ancestry matches that of elements or attributes in
<i>X(G)</i> serialized from occurrences of <i>N</i>.
</p>

<p>
<i>Proof:</i> In the FSA described above, split the state for each
nonterminal <i>N</i> into three states, one each for <i>N</i> serialized as
element, serialized as attribute, and hidden.  Ajust the transitions
accordingly.  The final state has now been split into three states;
drop the hidden-nonterminal state from the set <i>F</i>.  Then change every
transition to a hidden nonterminal to an empty transition, and delete
every transition out of any nonterminal serialized as an attribute.
For every nonterminal <i>N</i> serialized using an alias <i>A</i>, change the
symbol in all incoming arcs to state <i>N</i> to read <i>A</i> instead of <i>N</i>.
</p>

<p>
From this modified FSA, we can construct a regular expression matching
all and only the paths leading to serializations of <i>N</i> as an element,
and a second one matching all and only the paths leading to
serializations of <i>N</i> as an attribute, and we can construct an XPath
expression which constructs a string describing the ancestry of any
element or attribute.  The XPath expression will match all
serializations of <i>N</i> as attributes or elements, and also other
elements named <i>e</i> and attributes named <i>a</i> which share the same
ancestry but are serializations of some other nontterminal (if there
are any such).
</p>

<p>
For example, the serializations of nonterminal <i>b</i> in grammar <i>G4</i>
can be matched by the expression
</p>
<div class="org-src-container">
<pre class="src src-xpath">//e['/' || stringjoin(ancestor-or-self::*/name(), '/')
    eq
    '/a/d']
</pre>
</div>

<p>
<i>[Better example would be helpful, but the grammars given above are
all too simple.]</i>
</p>

<p>
<i>Theorem:</i> For any occurrence of nonterminal <i>N</i> in a right-hand side
of <i>G</i>, where <i>N</i> is serialized as an element <i>e</i>, it is possible to
construct an XPath expression matching all and only elements <i>e</i> whose
preceding element siblings match the preceding siblings of some
element <i>e</i> in <i>X(G)</i> serialized from an instance of <i>N</i> with the same
ancestry.
</p>

<p>
<i>Proof:</i> Without loss of generality, assume that there are no hidden
nonterminals in the right-hand side containing <i>N</i>.  (See below for
cases where this is not given a priori.)  If all terminal symbols and
all nonterminals to be serialized as attributes are deleted from the
expression, what remains is a regular expressoin over non-hidden
nonterminals.  This regular expression can be transformed into a
finite state automaton using standard methods.  If in that FSA the set
of final states is changed to include only the occurrences of <i>N</i>, the
FSA will accept all and only the left-to-right paths through the
content model which terminate in <i>N</i>.  A regular expression can be
constructed from that FSA, and from that regular expression an XPath
expression, along the lines shown above for the ancestry expression.
</p>

<p>
(It may be possible to construct the regular expression more directly,
but I don't currently see a clean way to do so.)
</p>

<p>
If the assumption does not hold, it can be made to hold by inlining
the definitions of the hidden nonterminals until either (a) there are
no more hidden nonterminals, or (b) the only remaining hidden
nonterminals are recursive but lack any descedants serialized as
elements.  In case (a), the assumption now holds.  In case (b) the
remaining hidden nonterminals can simply be deleted.  Since they
generate only character data, and character data is ignored in the
construction of the XPath expression, they cannot affect the XPath
expression.
</p>

<p>
<i>Corollary:</i> For any nonterminal <i>N</i> serialized as an element, it is
possible to construct an XPath expression which matches all elements
serialized from <i>N</i> and no elements which do not have the same upper
and left context as some of those elements.
</p>

<p>
<i>Proof:</i> Follows immediately.  The two XPath expressions described
above can be combined to select only elements whose ancestry and left
context are both suitable.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 9 July 2024</p>
<p class="author">Author: CMSMcQ</p>
<p class="date">Created: 2024-07-11 Thu 14:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
